<template>
  <q-page class="bg-white">
    <div class="container">
      <div class="ptb-100">
        <div
          class="card-oswald text-dark"
          style="
            font-size: 3vw;
            line-height: 3vw;
            font-weight: 700;
            text-transform: uppercase;
          "
        >
          {{ getInfo.title }}
        </div>
      </div>
      <q-card class="my-card" flat>
        <q-card-section horizontal>
          <q-card-section class="col-5">
            <q-img class="rounded-borders" :src="getInfo.img" />
          </q-card-section>
          <q-card-section class="">
            <div class="item-caption text-grey" v-html="getInfo.text"></div>
          </q-card-section>
        </q-card-section>

        <q-card-actions class="q-pa-md">
          <q-btn outline color="secondary" style="width: 300px" size="lg">
            Оставить заявку
          </q-btn>
        </q-card-actions>
      </q-card>
    </div>
  </q-page>
</template>

<script>
import { defineComponent } from "vue";
import cargo from "../assets/cargo.jpg";
import objects from "../assets/objects.jpg";
import personal from "../assets/personal.png";
export default defineComponent({
  name: "ServicesPage",
  data() {
    return {
      dialog: false,
      data: [
        {
          path: "objects",
          title: "Охрана объектов",
          img: objects,
          text: "Команда ООО «ОО «Магура» готова обеспечить безопасность функционирования объекта, сохранности его материального имущества, защиту жизни и здоровья его персонала. Действия по обеспечению безопасности объекта осуществляются обученными и подготовленными сотрудниками. В специально созданных центрах их обучают владению оружием, навыкам психоанализа, оказанию первой медицинской помощи, что поможет обеспечить надежную охрану объектов. В обязанности охранников входит: непосредственное присутствие на объекте, контроль территории, при необходимости досмотр людей на проходных пунктах предприятий, офисных зданий, фирм. Их деятельность осуществляется согласно Закону Российской Федерации от 11.03.1992 № 2487-1 «О частной детективной и охранной деятельности в Российской Федерации».",
        },
        {
          path: "cargo",
          title: "Сопровождение груза",
          img: cargo,
          text: "Охранная Организация «Магура» занимается сопровождением местных и междугородних перевозок груза. При оказании нашей компании данного вида услуг решаются задачи, как сохранности груза, так и обеспечения безопасности водителя во время оказания охранных услуг. Сотрудники охраны, привлекаемые нами для выполнения этих задач, имеют достаточную квалификацию и опыт. При принятии груза под охрану в обязательном порядке заполняется акт приёма, куда вписаны все средства обеспечения (пломбы). Эта информация досконально проверяется материально ответственными лицами в пункте назначения груза. Кроме того, наша компания осуществляет сопровождение и перевозку медицинских средств специально оборудованным транспортом, который оснащен климатическим оборудованием. Персонал охраны в обязательном порядке обеспечен GPS-трекером с выводом на наш пульт наблюдения. С помощью этого же устройства сотрудник охраны всегда может подать сигнал «Тревога» в нашу дежурную часть.",
        },
        {
          path: "personal",
          title: "Личная охрана",
          img: personal,
          text: "Личная охрана доступна в любое время, также все охранники вооружены огнестрельным оружием. Обеспечение безопасности охраняемого лица, независимо от того, какого рода опасность может ему угрожать – целенаправленное покушение или форс-мажорные обстоятельства. В компании ОО «КГБ» вы можете заказать различные услуги, включая: <br> - личная охрана на час <br> - постоянно личная охрана и сопровождение <br> - личный охранник для встречи клиента в аэропорту <br>- охрана на время проведения определенных торжественных мероприятий",
        },
        {
          path: "events",
          title: "Охрана мероприятий",
          img: objects,
          text: "Охрана культурно-массовых и спортивно-массовых мероприятий требует проведения целого комплекса организационных мер, направленных на обеспечение общественной безопасности. ООО «ОО «КГБ» обеспечит высокий уровень безопасности при охране массовых мероприятий любого типа. Гарантируем: безопасность имущества, здоровье гостей и сотрудников, неприкосновенность приглашенных на объектах в Санкт-Петербурге и Ленобласти. Мы предоставляем группу опытных лицензированных охранников и спецтранспорт. ООО «ОО «КГБ» оказывает охранные услуги на высшем уровне и берет на себя организацию контрольно-пропускного режима, координацию посетителей, контроль периметра, предупреждение и локализацию ситуаций, угрожающих жизни, здоровью и хорошему настроению гостей и персонала. Индивидуально подходим к каждому мероприятию. Обязанности и действия сотрудников охраны планируются согласно сценарию и согласовываются с организатором. ООО «ОО «КГБ» остается востребованной и на этом сегменте рынка охранных услуг и готова предоставить физическую охрану мероприятий для обеспечения Вашей безопасности.",
        },
      ],
    };
  },

  computed: {
    getInfo() {
      return this.data.filter((i) => i.path === this.$route.name)[0] ?? "";
    },
  },
  methods: {
    // getImageUrl(name) {
    //   return new URL(`${name}`, import.meta.url).href ?? "";
    // },
  },
});
</script>

<style lang="scss" scoped>
.item-caption {
  font-size: 16px;
  font-weight: 500;
}
</style>
